// Урок 1. Знакомство с языком программирования С#

// Task 2. Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
/*
Console.Write("Input first number: ");
int firstNum = Convert.ToInt32(Console.ReadLine());

Console.Write("Input second number: ");
int secondNum = Convert.ToInt32(Console.ReadLine());

if (firstNum>secondNum) Console.Write($"maximum = {firstNum}, minimum = {secondNum}");
else Console.Write($"maximum = {secondNum}, minimum = {firstNum}");
*/

// Task 4. Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

